# Brewfile - macOS package list (equivalent to packages-apt.txt)
# Install with: brew bundle --file=Brewfile

# Taps
tap "homebrew/bundle"

# Core CLI
brew "curl"
brew "git"
brew "wget"

# Search/navigation
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"

# Better defaults
brew "bat"
brew "eza"
brew "tree"
brew "jq"

# Dev workflow
brew "gh"
brew "tmux"
brew "direnv"
brew "pipx"

# Disk/system utilities
brew "ncdu"
brew "btop"
brew "trash"
brew "tldr"
brew "dust"

# Python
brew "uv"

# Rust toolchain
brew "rustup-init"

# Git enhancements
brew "git-delta"

# Casks (GUI apps)
cask "kitty"
cask "visual-studio-code"
cask "obsidian"
cask "discord"
