bierner.markdown-mermaid
biomejs.biome
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dracula-theme.theme-dracula
eamodio.gitlens
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
mikestead.dotenv
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.vscode-typescript-next
ms-vscode.vscode-websearchforcopilot
pkief.material-icon-theme
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vitest.explorer
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
